// Создать массив из 8 элементов и вывести их на экран.
int  A=new Random().Next(1,1000);
length. A = (8);

Console.WriteLine(); 

//Я не знаю как правильно указать переменную,
 //отвечающую за длинну массива!